Alark8/RL78_Framework/inc/rl78_g13_head.h
/*
** #######################################################################################################
**     Compilers:           ARM Compiler
**                          Freescale C/C++ for Embedded ARM
**                          GNU C Compiler
**                          GNU C Compiler - CodeSourcery Sourcery G++
**                          IAR ANSI C/C++ Compiler for ARM
**
**     Reference manual:    RL78UserGuide_Hardware.pdf
**     Version:             rev. 3.20, 01-07-2014
**
**     Abstract:
**         Renesas Peripheral Access Layer for G13 Family
**
**     Copyright: NCVE. All Rights Reserved.
**
**     Revisions:
**     - rev. 1.0 (2013-07-30)
**         Initial version.
**     
**		This revision is a complete access layer of Renesas G13 microcontroller family.
** #######################################################################################################
*/


#ifndef RL78_G13_HEAD_H
#define RL78_G13_HEAD_H

#include "config.h"


/* --------------------------------------------------------------- Port Configuration Handlers ----------------------------------------------------------- */

/* Pull-up Resistor Option Register Definition */
typedef struct {
	volatile uint8_t PU0;
	volatile uint8_t PU1;
	volatile uint8_t BL1;
	volatile uint8_t PU3;
	volatile uint8_t PU4;
	volatile uint8_t PU5;
	volatile uint8_t PU6;
	volatile uint8_t PU7;
	volatile uint8_t PU8;
	volatile uint8_t PU9;
	volatile uint8_t PU10;
	volatile uint8_t PU11;
	volatile uint8_t PU12;
	volatile uint8_t BL2;
	volatile uint8_t PU14;
}PUR_Type, *PUR_MemMapPtr;


#define PULL_UP_RESISTOR_BASE												   															(0x0030)
#define PUR															 			 							 ((PUR_Type *)PULL_UP_RESISTOR_BASE)


/* Port Input Mode Register Definition */
typedef struct {
	volatile uint8_t PIM0;
	volatile uint8_t PIM1;
	volatile uint8_t BL1[2];
	volatile uint8_t PIM4;
	volatile uint8_t PIM5;
	volatile uint8_t BL2[2];
	volatile uint8_t PIM8;
	volatile uint8_t BL3[5];
	volatile uint8_t PIM14;
}PIM_Type, *PIM_MemMapPtr;


#define PORT_INPUT_MODE_REGISTER_BASE	   					    					   												    (0x0040)
#define PIM									 							 							 ((PIM_Type *)PORT_INPUT_MODE_REGISTER_BASE)



/* Port Output Mode Register Definition */
typedef struct {
	volatile uint8_t POM0;
	volatile uint8_t POM1;
	volatile uint8_t BL1[2];
	volatile uint8_t POM4;
	volatile uint8_t POM5;
	volatile uint8_t BL2;
	volatile uint8_t POM7;
	volatile uint8_t POM8;
	volatile uint8_t POM9;
	volatile uint8_t BL3[4];
}POM_Type, *POM_MemMapPtr;


#define PORT_OUTPUT_MODE_REGISTER_BASE							                                   										(0x0050)
#define POM									       													((POM_Type *)PORT_OUTPUT_MODE_REGISTER_BASE)



/* Port Mode Control Register */
typedef struct {
	volatile uint8_t PMC0;
	volatile uint8_t BL1[2];
	volatile uint8_t PMC3;
	volatile uint8_t BL2[6];
	volatile uint8_t PMC10;
	volatile uint8_t PMC11;
	volatile uint8_t PMC12;
	volatile uint8_t BL3;
	volatile uint8_t PMC14;
}PMC_Type, *PMC_MemMapPtr;


#define PORT_MODE_CONTROL_REGISTER_BASE											   														(0x0060)
#define PMC									      					   							   ((PMC_Type *)PORT_MODE_CONTROL_REGISTER_BASE)



/* Port Register Definition */
typedef struct {
	volatile uint8_t P0;
	volatile uint8_t P1;
	volatile uint8_t P2;
	volatile uint8_t P3;
	volatile uint8_t P4;
	volatile uint8_t P5;
	volatile uint8_t P6;
	volatile uint8_t P7;
	volatile uint8_t P8;
	volatile uint8_t P9;
	volatile uint8_t P10;
	volatile uint8_t P11;
	volatile uint8_t P12;
	volatile uint8_t P13;
	volatile uint8_t P14;
	volatile uint8_t P15;
} PORT_Type, *PORT_MemMapPtr;


#define PORT_REGISTER_BASE												   																(0xFF00)
#define PORT											  						   							   ((PORT_Type *)PORT_REGISTER_BASE)


/* Port Mode Register Definition */
typedef struct {
	volatile uint8_t PM0;
	volatile uint8_t PM1;
	volatile uint8_t PM2;
	volatile uint8_t PM3;
	volatile uint8_t PM4;
	volatile uint8_t PM5;
	volatile uint8_t PM6;
	volatile uint8_t PM7;
	volatile uint8_t PM8;
	volatile uint8_t PM9;
	volatile uint8_t PM10;
	volatile uint8_t PM11;
	volatile uint8_t PM12;
	volatile uint8_t BL1;
	volatile uint8_t PM14;
	volatile uint8_t PM15;
}PMR_Type, *PMR_MemMapPtr;


#define PORT_MODE_REGISTER_BASE												   															(0xFF20)
#define PMR										      						   							   ((PMR_Type *)PORT_MODE_REGISTER_BASE)

/* Peripheral Input/Output Redirection Register Address */
#define PERIPHERAL_IO_REDIR_REGISTER_BASE										   														(0x0077)
#define PERIPHERAL_IO_REDIR_REGISTER					    							*((volatile uint8_t *)PERIPHERAL_IO_REDIR_REGISTER_BASE)

/* Global Digital Input Disable Register Address */
#define GLOBAL_DIGITAL_INPUT_DISABLE_REGISTER_BASE									   													(0x007D)
#define GLOBAL_DIGITAL_INPUT_DISABLE_REGISTER			  					   *((volatile uint8_t *)GLOBAL_DIGITAL_INPUT_DISABLE_REGISTER_BASE)

/* --------------------------------------------------------------- Port Configuration Handlers ----------------------------------------------------------- */












/* ------------------------------------------------------------ Timer Configuration Handlers ------------------------------------------------------------ */

/* Timer Data Register Definition */
typedef struct {
	union {
		volatile uint8_t TDR_L;
		volatile uint8_t TDR_H;
	}ACCESS_8bit;
	
	volatile uint16_t TDR;
}TDR_Type, *TDR_MemMapPtr;


#define TIMER_DATA_REGISTER_00_BASE											   															(0xFF18)
#define TDR00										  												   ((TDR_Type *)TIMER_DATA_REGISTER_00_BASE)

#define TIMER_DATA_REGISTER_01_BASE											   															(0xFF1A)
#define TDR01										  												   ((TDR_Type *)TIMER_DATA_REGISTER_01_BASE)

#define TIMER_DATA_REGISTER_02_BASE											   															(0xFF64)
#define TDR02										  												   ((TDR_Type *)TIMER_DATA_REGISTER_02_BASE)

#define TIMER_DATA_REGISTER_03_BASE											   															(0xFF66)
#define TDR03										  												   ((TDR_Type *)TIMER_DATA_REGISTER_03_BASE)

