Alark8/RL78_Framework/inc/rl78_g13_head.h
#define TIMER_DATA_REGISTER_04_BASE											   															(0xFF68)
#define TDR04										  												   ((TDR_Type *)TIMER_DATA_REGISTER_04_BASE)

#define TIMER_DATA_REGISTER_05_BASE											   															(0xFF6A)
#define TDR05										  												   ((TDR_Type *)TIMER_DATA_REGISTER_05_BASE)

#define TIMER_DATA_REGISTER_06_BASE											   															(0xFF6C)
#define TDR06										  												   ((TDR_Type *)TIMER_DATA_REGISTER_06_BASE)

#define TIMER_DATA_REGISTER_07_BASE											   															(0xFF6E)
#define TDR07										  												   ((TDR_Type *)TIMER_DATA_REGISTER_07_BASE)

#define TIMER_DATA_REGISTER_10_BASE											   															(0xFF70)
#define TDR10										  												   ((TDR_Type *)TIMER_DATA_REGISTER_10_BASE)

#define TIMER_DATA_REGISTER_11_BASE											   															(0xFF72)
#define TDR11										  												   ((TDR_Type *)TIMER_DATA_REGISTER_11_BASE)

#define TIMER_DATA_REGISTER_12_BASE											   															(0xFF74)
#define TDR12										  												   ((TDR_Type *)TIMER_DATA_REGISTER_12_BASE)

#define TIMER_DATA_REGISTER_13_BASE											   															(0xFF76)
#define TDR13										  												   ((TDR_Type *)TIMER_DATA_REGISTER_13_BASE)

#define TIMER_DATA_REGISTER_14_BASE											   															(0xFF78)
#define TDR14										  												   ((TDR_Type *)TIMER_DATA_REGISTER_14_BASE)

#define TIMER_DATA_REGISTER_15_BASE											   															(0xFF7A)
#define TDR15										  												   ((TDR_Type *)TIMER_DATA_REGISTER_15_BASE)

#define TIMER_DATA_REGISTER_16_BASE											   															(0xFF7C)
#define TDR16										  												   ((TDR_Type *)TIMER_DATA_REGISTER_16_BASE)

#define TIMER_DATA_REGISTER_17_BASE											   															(0xFF7E)
#define TDR17										  												   ((TDR_Type *)TIMER_DATA_REGISTER_17_BASE)



/* Timer Configuration Register Definition */
typedef struct {
	volatile uint8_t NFEN0;
	volatile uint8_t NFEN1;
	volatile uint8_t NFEN2;
	volatile uint8_t ISC;
	volatile uint8_t TIS0;
}TMR_Config_Type, *TMR_Config_MemMapPtr;


#define TIMER_CONFIG_REGISTER_BASE										 	   															(0x0070)
#define TMR_CONFIG								    											 ((TMR_Config_Type *)TIMER_CONFIG_REGISTER_BASE)



/* Timer Information Register Definition */
typedef struct {
	volatile uint16_t TE;
	volatile uint16_t TS;
	volatile uint16_t TT;
	volatile uint16_t TPS;
	volatile uint16_t TO;
	volatile uint16_t TOE;
	volatile uint16_t TOL;
	volatile uint16_t TOM;
}TIMER_Type, *TIMER_MemMapPtr;


#define TIMER0_REGISTER_BASE												   															(0x01B0)
#define TIMER0										       													((TIMER_Type *)TIMER0_REGISTER_BASE)

#define TIMER1_REGISTER_BASE												   															(0x01F0)
#define TIMER1										       													((TIMER_Type *)TIMER1_REGISTER_BASE)



/* Timer Counter Register Definition */
typedef struct {
	volatile uint16_t TCR;
}TCR_Type, *TCR_MemMapPtr;


#define TIMER_COUNTER_REGISTER_00_BASE											   														(0x0180)
#define TCR00									       												((TCR_Type *)TIMER_COUNTER_REGISTER_00_BASE)

#define TIMER_COUNTER_REGISTER_01_BASE											   														(0x0182)
#define TCR01									       												((TCR_Type *)TIMER_COUNTER_REGISTER_01_BASE)

#define TIMER_COUNTER_REGISTER_02_BASE											   														(0x0184)
#define TCR02									       												((TCR_Type *)TIMER_COUNTER_REGISTER_02_BASE)

#define TIMER_COUNTER_REGISTER_03_BASE										           													(0x0186)
#define TCR03									       												((TCR_Type *)TIMER_COUNTER_REGISTER_03_BASE)

#define TIMER_COUNTER_REGISTER_04_BASE											   														(0x0188)
#define TCR04									       												((TCR_Type *)TIMER_COUNTER_REGISTER_04_BASE)

#define TIMER_COUNTER_REGISTER_05_BASE											   														(0x018A)
#define TCR05									       												((TCR_Type *)TIMER_COUNTER_REGISTER_05_BASE)

#define TIMER_COUNTER_REGISTER_06_BASE											   														(0x018C)
#define TCR06									       												((TCR_Type *)TIMER_COUNTER_REGISTER_06_BASE)

#define TIMER_COUNTER_REGISTER_07_BASE										           													(0x018E)
#define TCR07									       												((TCR_Type *)TIMER_COUNTER_REGISTER_07_BASE)

#define TIMER_COUNTER_REGISTER_10_BASE											   														(0x01C0)
#define TCR10									       												((TCR_Type *)TIMER_COUNTER_REGISTER_10_BASE)

#define TIMER_COUNTER_REGISTER_11_BASE											   														(0x01C2)
#define TCR11									       												((TCR_Type *)TIMER_COUNTER_REGISTER_11_BASE)

#define TIMER_COUNTER_REGISTER_12_BASE											   														(0x01C4)
#define TCR12									      												((TCR_Type *)TIMER_COUNTER_REGISTER_12_BASE)

#define TIMER_COUNTER_REGISTER_13_BASE											   														(0x01C6)
#define TCR13									       												((TCR_Type *)TIMER_COUNTER_REGISTER_13_BASE)

#define TIMER_COUNTER_REGISTER_14_BASE											   														(0x01C8)
#define TCR14									       												((TCR_Type *)TIMER_COUNTER_REGISTER_14_BASE)

#define TIMER_COUNTER_REGISTER_15_BASE											   														(0x01CA)
#define TCR15									       												((TCR_Type *)TIMER_COUNTER_REGISTER_15_BASE)

#define TIMER_COUNTER_REGISTER_16_BASE											   														(0x01CC)
#define TCR16									       												((TCR_Type *)TIMER_COUNTER_REGISTER_16_BASE)

#define TIMER_COUNTER_REGISTER_17_BASE											   														(0x01CE)
#define TCR17									       												((TCR_Type *)TIMER_COUNTER_REGISTER_17_BASE)



/* Timer Mode Register Definition */
typedef struct {
	volatile uint16_t TMR;
}TMR_Type, *TMR_MemMapPtr;


#define TIMER_MODE_REGISTER_00_BASE											   															(0x0190)
#define TMR00										  												   ((TMR_Type *)TIMER_MODE_REGISTER_00_BASE)

#define TIMER_MODE_REGISTER_01_BASE											   															(0x0192)
#define TMR01										  												   ((TMR_Type *)TIMER_MODE_REGISTER_01_BASE)

#define TIMER_MODE_REGISTER_02_BASE											   															(0x0194)
#define TMR02										  												   ((TMR_Type *)TIMER_MODE_REGISTER_02_BASE)

