Alark8/RL78_Framework/inc/rl78_g13_head.h
#define TIMER_MODE_REGISTER_03_BASE											   															(0x0196)
#define TMR03										  												   ((TMR_Type *)TIMER_MODE_REGISTER_03_BASE)

#define TIMER_MODE_REGISTER_04_BASE											   															(0x0198)
#define TMR04										 												   ((TMR_Type *)TIMER_MODE_REGISTER_04_BASE)

#define TIMER_MODE_REGISTER_05_BASE											   															(0x019A)
#define TMR05										  												   ((TMR_Type *)TIMER_MODE_REGISTER_05_BASE)

#define TIMER_MODE_REGISTER_06_BASE											   															(0x019C)
#define TMR06										  												   ((TMR_Type *)TIMER_MODE_REGISTER_06_BASE)

#define TIMER_MODE_REGISTER_07_BASE											   															(0x019E)
#define TMR07										   												   ((TMR_Type *)TIMER_MODE_REGISTER_07_BASE)

#define TIMER_MODE_REGISTER_10_BASE											  	 														(0x01D0)
#define TMR10										  												   ((TMR_Type *)TIMER_MODE_REGISTER_10_BASE)

#define TIMER_MODE_REGISTER_11_BASE											   															(0x01D2)
#define TMR11										  												   ((TMR_Type *)TIMER_MODE_REGISTER_11_BASE)

#define TIMER_MODE_REGISTER_12_BASE											   															(0x01D4)
#define TMR12										  												   ((TMR_Type *)TIMER_MODE_REGISTER_12_BASE)

#define TIMER_MODE_REGISTER_13_BASE											   															(0x01D6)
#define TMR13										  												   ((TMR_Type *)TIMER_MODE_REGISTER_13_BASE)

#define TIMER_MODE_REGISTER_14_BASE											   															(0x01D8)
#define TMR14										  												   ((TMR_Type *)TIMER_MODE_REGISTER_14_BASE)

#define TIMER_MODE_REGISTER_15_BASE											   															(0x01DA)
#define TMR15										  												   ((TMR_Type *)TIMER_MODE_REGISTER_15_BASE)

#define TIMER_MODE_REGISTER_16_BASE											   															(0x01DC)
#define TMR16										  												   ((TMR_Type *)TIMER_MODE_REGISTER_16_BASE)

#define TIMER_MODE_REGISTER_17_BASE											   															(0x01DE)
#define TMR17										  												   ((TMR_Type *)TIMER_MODE_REGISTER_17_BASE)



/* Timer Status Register Definition */
typedef struct {
	union {
		volatile uint8_t TSR_L;
		volatile uint8_t TSR_H;
	}ACCESS_8bit;
	volatile uint16_t TSR;
}TSR_Type, *TSR_MemMapPtr;


#define TIMER_STATUS_REGISTER_00_BASE											   														(0x01A0)
#define TSR00																						 ((TSR_Type *)TIMER_STATUS_REGISTER_00_BASE)

#define TIMER_STATUS_REGISTER_01_BASE											   														(0x01A2)
#define TSR01																						 ((TSR_Type *)TIMER_STATUS_REGISTER_01_BASE)

#define TIMER_STATUS_REGISTER_02_BASE											   														(0x01A4)
#define TSR02																						 ((TSR_Type *)TIMER_STATUS_REGISTER_02_BASE)

#define TIMER_STATUS_REGISTER_03_BASE											   														(0x01A6)
#define TSR03																						 ((TSR_Type *)TIMER_STATUS_REGISTER_03_BASE)

#define TIMER_STATUS_REGISTER_04_BASE											   														(0x01A8)
#define TSR04																						 ((TSR_Type *)TIMER_STATUS_REGISTER_04_BASE)

#define TIMER_STATUS_REGISTER_05_BASE											   														(0x01AA)
#define TSR05																						 ((TSR_Type *)TIMER_STATUS_REGISTER_05_BASE)

#define TIMER_STATUS_REGISTER_06_BASE											   														(0x01AC)
#define TSR06																						 ((TSR_Type *)TIMER_STATUS_REGISTER_06_BASE)

#define TIMER_STATUS_REGISTER_07_BASE											   														(0x01AE)
#define TSR07																						 ((TSR_Type *)TIMER_STATUS_REGISTER_07_BASE)

#define TIMER_STATUS_REGISTER_10_BASE											   														(0x01E0)
#define TSR10																						 ((TSR_Type *)TIMER_STATUS_REGISTER_10_BASE)

#define TIMER_STATUS_REGISTER_11_BASE											   														(0x01E2)
#define TSR11																						 ((TSR_Type *)TIMER_STATUS_REGISTER_11_BASE)

#define TIMER_STATUS_REGISTER_12_BASE											   														(0x01E4)
#define TSR12																						 ((TSR_Type *)TIMER_STATUS_REGISTER_12_BASE)

#define TIMER_STATUS_REGISTER_13_BASE											   														(0x01E6)
#define TSR13																						 ((TSR_Type *)TIMER_STATUS_REGISTER_13_BASE)

#define TIMER_STATUS_REGISTER_14_BASE											   														(0x01E8)
#define TSR14																						 ((TSR_Type *)TIMER_STATUS_REGISTER_14_BASE)

#define TIMER_STATUS_REGISTER_15_BASE											   														(0x01EA)
#define TSR15																						 ((TSR_Type *)TIMER_STATUS_REGISTER_15_BASE)

#define TIMER_STATUS_REGISTER_16_BASE											   														(0x01EC)
#define TSR16																						 ((TSR_Type *)TIMER_STATUS_REGISTER_16_BASE)

#define TIMER_STATUS_REGISTER_17_BASE											   														(0x01EE)
#define TSR17																						 ((TSR_Type *)TIMER_STATUS_REGISTER_17_BASE)

/* 12 bit Timer Control Register Base Address */
#define INTERVAL_TIMER_CTRL_REGISTER_BASE					 					   														(0xFF90)
#define INTERVAL_TIMER_CTRL_REGISTER					   								*((volatile uint8_t *)INTERVAL_TIMER_CTRL_REGISTER_BASE)

/* ------------------------------------------------------------ Timer Configuration Handlers ------------------------------------------------------------ */














/* -------------------------------------------------------------- ADC Configuration Handlers ------------------------------------------------------------ */

/* ADC Config Register Definition */
typedef struct {
	volatile uint8_t ADM0;
	volatile uint8_t ADS;
	volatile uint8_t ADM1;
}ADC0_Config_Type, *ADC0_Config_MemMapPtr;


#define ADC0_CONFIGURATION_REGISTER_BASE										   														(0xFF30)
#define ADC0_CONFIG							     										  ((ADC0_Config_Type *)ADC0_CONFIGURATION_REGISTER_BASE)



/* ADC Config Register Definition */
typedef struct {
	volatile uint8_t ADM2;
	volatile uint8_t ADUL;
	volatile uint8_t ADLL;
	volatile uint8_t ADTES;
}ADC1_Config_Type, *ADC1_Config_MemMapPtr;


#define ADC1_CONFIGURATION_REGISTER_BASE										   														(0x0010)
#define ADC1_CONFIG							     										  ((ADC1_Config_Type *)ADC1_CONFIGURATION_REGISTER_BASE)

/* ADC Conversion Result Register Address */
#define ADC_CONVERSION_RESULT_BASE											   															(0xFF1E)
#define ADC_CONVERSION_RESULT							 									  *((volatile uint16_t *)ADC_CONVERSION_RESULT_BASE)

/* ADC Port Configuration Register Address */
#define ADC_PORT_CONFIG_REGISTER_BASE											   														(0x0076)
#define ADC_PORT_CONFIG_REGISTER					       									*((volatile uint8_t *)ADC_PORT_CONFIG_REGISTER_BASE)

/* -------------------------------------------------------------- ADC Configuration Handlers ------------------------------------------------------------ */












/* -------------------------------------------------------------- I2C Configuration Handlers ------------------------------------------------------------ */

/* I2C Data Register Definition */
typedef struct {
	volatile uint8_t I2CA;
	volatile uint8_t I2CS;
	volatile uint8_t I2CF;
}I2C_Type, *I2C_MemMapPtr;


#define I2C_REGISTER_0_BASE												   																(0xFF50)
#define I2C0											  													   ((I2C_Type *)I2C_REGISTER_0_BASE)

#define I2C_REGISTER_1_BASE												   																(0xFF54)
#define I2C1											  													   ((I2C_Type *)I2C_REGISTER_1_BASE)



/* I2C Configuration Register Definition */
typedef struct {
	volatile uint8_t I2CCTRL0;
	volatile uint8_t I2CCTRL1;
	volatile uint8_t I2CWL;
	volatile uint8_t I2CWH;
	volatile uint8_t SVA;
}I2C_Config_Type, *I2C_Config_MemMapPtr;


