Alark8/RL78_Framework/inc/rl78_g13_head.h
#define I2C_CONFIGURATION_REGISTER_0_BASE										   														(0x0230)
#define I2C0_CONFIG							     										  ((I2C_Config_Type *)I2C_CONFIGURATION_REGISTER_0_BASE)

#define I2C_CONFIGURATION_REGISTER_1_BASE										   														(0x0238)
#define I2C1_CONFIG							     										  ((I2C_Config_Type *)I2C_CONFIGURATION_REGISTER_1_BASE)

/* -------------------------------------------------------------- I2C Configuration Handlers ------------------------------------------------------------ */















/* ------------------------------------------------------------- RTC Configuration Handlers ------------------------------------------------------------ */

/* RTC Register Definition */
typedef struct {
	volatile uint8_t SEC;
	volatile uint8_t MIN;
	volatile uint8_t HOUR;
	volatile uint8_t WEEK;
	volatile uint8_t DAY;
	volatile uint8_t MONTH;
	volatile uint8_t YEAR;
	volatile uint8_t SUBCUD;
	volatile uint8_t ALARMWM;
	volatile uint8_t ALARMWH;
	volatile uint8_t ALARMWW;
	volatile uint8_t RTCC0;
	volatile uint8_t RTCC1;
}RTC_Type, *RTC_MemMapPtr;


#define RTC_REGISTER_BASE												   																(0xFF92)
#define RTC											    														 ((RTC_Type *)RTC_REGISTER_BASE)

/* ------------------------------------------------------------- RTC Configuration Handlers ------------------------------------------------------------ */














/* ----------------------------------------------------------- DMA Configuration Handlers ------------------------------------------------------------ */

/* DMA SFR Register Definition */
typedef struct {
	volatile uint8_t DSA;
}DMA_Type, *DMA_MemMapPtr;


#define DMA_SFR_REGISTER_0_BASE												   															(0xFFB0)
#define DSA0										      												   ((DMA_Type *)DMA_SFR_REGISTER_0_BASE)

#define DMA_SFR_REGISTER_1_BASE												   															(0xFFB1)
#define DSA1										      												   ((DMA_Type *)DMA_SFR_REGISTER_1_BASE)

#define DMA_SFR_REGISTER_2_BASE												   															(0x0200)
#define DSA2										      												   ((DMA_Type *)DMA_SFR_REGISTER_2_BASE)

#define DMA_SFR_REGISTER_3_BASE												   															(0x0201)
#define DSA3										      												   ((DMA_Type *)DMA_SFR_REGISTER_3_BASE)



/* DMA RAM Register Definition */
typedef struct {
	union {
		volatile uint8_t DRA_L;
		volatile uint8_t DRA_H;
	}ACCESS_8bit;
	volatile uint16_t DRA;
}DMA_RAM_Type, *DMA_RAM_MemMapPtr;


#define DMA_RAM_REGISTER_0_BASE												   															(0xFFB2)
#define DRA0										  												   ((DMA_RAM_Type *)DMA_RAM_REGISTER_0_BASE)

#define DMA_RAM_REGISTER_1_BASE												   															(0xFFB4)
#define DRA1										  												   ((DMA_RAM_Type *)DMA_RAM_REGISTER_1_BASE)

#define DMA_RAM_REGISTER_2_BASE												   															(0x0202)
#define DRA2										  												   ((DMA_RAM_Type *)DMA_RAM_REGISTER_2_BASE)

#define DMA_RAM_REGISTER_3_BASE												   															(0x0204)
#define DRA3										  												   ((DMA_RAM_Type *)DMA_RAM_REGISTER_3_BASE)



/* DMA Byte Count Register Definition */
typedef struct {
	volatile uint8_t DBC_L;
	volatile uint8_t DBC_H;
}DMA_BC_Type, *DMA_BC_MemMapPtr;


#define DMA_BYTE_COUNT_REGISTER_0_BASE											   														(0xFFB6)
#define DBC0									    											 ((DMA_BC_Type *)DMA_BYTE_COUNT_REGISTER_0_BASE)

#define DMA_BYTE_COUNT_REGISTER_1_BASE											   														(0xFFB8)
#define DBC1									    											 ((DMA_BC_Type *)DMA_BYTE_COUNT_REGISTER_1_BASE)

#define DMA_BYTE_COUNT_REGISTER_2_BASE											   														(0x0206)
#define DBC2									    											 ((DMA_BC_Type *)DMA_BYTE_COUNT_REGISTER_2_BASE)

#define DMA_BYTE_COUNT_REGISTER_3_BASE											   														(0x0208)
#define DBC3									    											 ((DMA_BC_Type *)DMA_BYTE_COUNT_REGISTER_3_BASE)



/* DMA Mode Control Register Definition */
typedef struct {
	volatile uint8_t DMC;
}DMA_MC_Type, *DMA_MC_MemMapPtr;


#define DMA_MODE_CONTROL_REGISTER_0_BASE										   														(0xFFBA)
#define DMC0									   												(DMA_MC_Type *)DMA_MODE_CONTROL_REGISTER_0_BASE)

#define DMA_MODE_CONTROL_REGISTER_1_BASE										   														(0xFFBB)
#define DMC1									   												(DMA_MC_Type *)DMA_MODE_CONTROL_REGISTER_1_BASE)

#define DMA_MODE_CONTROL_REGISTER_2_BASE										   														(0x020A)
#define DMC2									   												(DMA_MC_Type *)DMA_MODE_CONTROL_REGISTER_2_BASE)

#define DMA_MODE_CONTROL_REGISTER_3_BASE										   														(0x020B)
#define DMC3									   												(DMA_MC_Type *)DMA_MODE_CONTROL_REGISTER_3_BASE)



/* DMA Operation Control Register Definition */
typedef struct {
	volatile uint8_t DRC;
}DMA_OC_Type, *DMA_OC_MemMapPtr;


#define DMA_OPER_CONTROL_REGISTER_0_BASE										   														(0xFFBC)
#define DRC0									   												(DMA_OC_Type *)DMA_OPER_CONTROL_REGISTER_0_BASE)

#define DMA_OPER_CONTROL_REGISTER_1_BASE										   														(0xFFBD)
#define DRC1									   												(DMA_OC_Type *)DMA_OPER_CONTROL_REGISTER_1_BASE)

#define DMA_OPER_CONTROL_REGISTER_2_BASE										   														(0x020C)
#define DRC2									   												(DMA_OC_Type *)DMA_OPER_CONTROL_REGISTER_2_BASE)

#define DMA_OPER_CONTROL_REGISTER_3_BASE										   														(0x020D)
#define DRC3									   												(DMA_OC_Type *)DMA_OPER_CONTROL_REGISTER_3_BASE)

/* ----------------------------------------------------------- DMA Configuration Handlers ------------------------------------------------------------ */













/* ---------------------------------------------------------- Interrupt Configuration Handlers ------------------------------------------------------ */

/* Interrupt Request Flag Register Definition */
typedef struct {
	union {
		volatile uint8_t IF_L;
		volatile uint8_t IF_H;
	}ACCESS_8bit;
	volatile uint16_t IF;
}IRF_Req_Type, *IRF_Req_MemMapPtr;


#define INTERRUPT_REQ_FLAG_REGISTER_0_BASE										   														(0xFFE0)
#define IF0																					 (IRF_Req_Type *)INTERRUPT_REQ_FLAG_REGISTER_0_BASE)

#define INTERRUPT_REQ_FLAG_REGISTER_1_BASE										   														(0xFFE2)
#define IF1																					 (IRF_Req_Type *)INTERRUPT_REQ_FLAG_REGISTER_1_BASE)

#define INTERRUPT_REQ_FLAG_REGISTER_2_BASE										   														(0xFFD0)
#define IF2																					 (IRF_Req_Type *)INTERRUPT_REQ_FLAG_REGISTER_2_BASE)

#define INTERRUPT_REQ_FLAG_REGISTER_3_BASE										   														(0xFFD2)
#define IF3																					 (IRF_Req_Type *)INTERRUPT_REQ_FLAG_REGISTER_3_BASE)



/* Interrupt Mask Flag Register Definition */
typedef struct {
	union {
		volatile uint8_t MK_L;
		volatile uint8_t MK_H;
	}ACCESS_8bit;
	volatile uint16_t MK;
}IRF_Mask_Type, *IRF_Mask_MemMapPtr;


#define INTERRUPT_MASK_FLAG_REGISTER_0_BASE										  														(0xFFE4)
#define MK0								       												(IRF_Req_Type *)INTERRUPT_MASK_FLAG_REGISTER_0_BASE)

