Alark8/RL78_Framework/inc/rl78_g13_head.h
#define INTERRUPT_MASK_FLAG_REGISTER_1_BASE										   														(0xFFE6)
#define MK1								       												(IRF_Req_Type *)INTERRUPT_MASK_FLAG_REGISTER_1_BASE)

#define INTERRUPT_MASK_FLAG_REGISTER_2_BASE										   														(0xFFD4)
#define MK2								       												(IRF_Req_Type *)INTERRUPT_MASK_FLAG_REGISTER_2_BASE)

#define INTERRUPT_MASK_FLAG_REGISTER_3_BASE										   														(0xFFD6)
#define MK3								       												(IRF_Req_Type *)INTERRUPT_MASK_FLAG_REGISTER_3_BASE)



/* External Interrupt Register 0 Definition */
typedef struct {
	volatile uint8_t EGP;
	volatile uint8_t EGN;
}EXT_Interrupt_Type, *EXT_Interrupt_MemMapPtr;


#define EXT_INTERRUPT_EDGE_ENABLE_REGISTER_0_BASE									   													(0xFF38)
#define EXT_INT0						  									   ((EXT_Interrupt_Type *)EXT_INTERRUPT_EDGE_ENABLE_REGISTER_0_BASE)

#define EXT_INTERRUPT_EDGE_ENABLE_REGISTER_1_BASE									   													(0xFF3A)
#define EXT_INT1						  									   ((EXT_Interrupt_Type *)EXT_INTERRUPT_EDGE_ENABLE_REGISTER_1_BASE)

/* ---------------------------------------------------------- Interrupt Configuration Handlers ------------------------------------------------------ */













/* ---------------------------------------------------------- Clock Configuration Handlers --------------------------------------------------------- */

/* Clock Registers Definition */
typedef struct{
	volatile uint8_t CMC;
	volatile uint8_t CSC;
	volatile uint8_t OSTC;
	volatile uint8_t OSTS;
	volatile uint8_t CKC;
	volatile uint8_t CKS0;
	volatile uint8_t CKS1;
}CLK_Type, *CLK_MemMapPtr;


#define CLOCK_CONFIGURATION_REGISTER_BASE										   														(0xFFA0)
#define CLOCK									    											 ((CLK_Type *)CLOCK_CONFIGURATION_REGISTER_BASE)

/* High Speed Oscillator Trimming Register Address */
#define HIGH_SPEED_OSC_TRIM_REGISTER_BASE										   														(0x00A0)
#define HIGH_SPEED_OSC_TRIM_REGISTER					   								*((volatile uint8_t *)HIGH_SPEED_OSC_TRIM_REGISTER_BASE)

/* High Speed Oscillator Frequency Select Register Address */
#define HIGH_SPEED_OSC_FREQ_SELECT_REGISTER_BASE									   													(0x00A8)
#define HIGH_SPEED_OSC_FREQ_SELECT_REGISTER			    						 *((volatile uint8_t *)HIGH_SPEED_OSC_FREQ_SELECT_REGISTER_BASE)

/* Sub System Clock Supply Mode Control Register Address */
#define SUB_SYS_CLK_SUPPLY_MODE_CTRL_REG_BASE									           												(0x00F3)
#define SUB_SYS_CLK_SUPPLY_MODE_CTRL_REGISTER			       						*((volatile uint8_t *)SUB_SYS_CLK_SUPPLY_MODE_CTRL_REG_BASE)

/* ---------------------------------------------------------- Clock Configuration Handlers --------------------------------------------------------- */














/* ------------------------------------------------------------ Safety Function Registers ---------------------------------------------------------- */

/* CRC Input Register Base Address */
#define CRC_INPUT_REGISTER_BASE												   															(0xFFAC)
#define CRC_INPUT_REGISTER							     										  *((volatile uint8_t *)CRC_INPUT_REGISTER_BASE)

/* Invalid Memory Access Detection Control Register Address */
#define INVALID_MEM_ACCESS_DETECT_CTRL_REGISTER_BASE								  	   												(0x0078)
#define INVALID_MEM_ACCESS_DETECT_CTRL_REGISTER								 *((volatile uint8_t *)INVALID_MEM_ACCESS_DETECT_CTRL_REGISTER_BASE)

/* RAM Parity Error Control Register Address */
#define RAM_PARITY_ERROR_CTRL_REGISTER_BASE										   														(0x00F5)
#define RAM_PARITY_ERROR_CTRL_REGISTER					 							  *((volatile uint8_t *)RAM_PARITY_ERROR_CTRL_REGISTER_BASE)

/* Flash Memory CRC Control Register Address */
#define FLASH_MEM_CRC_CTRL_REGISTER_BASE										   														(0x02F0)
#define FLASH_MEM_CRC_CTRL_REGISTER					    								 *((volatile uint8_t *)FLASH_MEM_CRC_CTRL_REGISTER_BASE)

/* Flash Memory CRC Operation Result Register Address */
#define FLASH_MEM_CRC_OPER_RESULT_REGISTER_BASE										   													(0x02F2)
#define FLASH_MEM_CRC_OPER_RESULT_REGISTER			    						 *((volatile uint16_t *)FLASH_MEM_CRC_OPER_RESULT_REGISTER_BASE)

/* CRC Data Register */
#define CRC_DATA_REGISTER_BASE												   															(0x02FA)
#define CRC_DATA_REGISTER							     										  *((volatile uint16_t *)CRC_DATA_REGISTER_BASE)

/* ------------------------------------------------------------ Safety Function Registers ---------------------------------------------------------- */














/* ------------------------------------------------------------- Serial Control Registers --------------------------------------------------------- */

/* Serial Data Register Definition */
typedef struct {
	volatile uint8_t SDR_L;
	volatile uint8_t SDR_H;
} SDR_Type, *SDR_MemMapPtr;


#define SERIAL_DATA_REGISTER_00_BASE											   														(0xFF10)
#define SDR00										  												   (SDR_Type *)SERIAL_DATA_REGISTER_00_BASE)

#define SERIAL_DATA_REGISTER_01_BASE											   														(0xFF12)
#define SDR01										  												   (SDR_Type *)SERIAL_DATA_REGISTER_01_BASE)

#define SERIAL_DATA_REGISTER_02_BASE											   														(0xFF44)
#define SDR02										  												   (SDR_Type *)SERIAL_DATA_REGISTER_02_BASE)

#define SERIAL_DATA_REGISTER_03_BASE											   														(0xFF46)
#define SDR03										  												   (SDR_Type *)SERIAL_DATA_REGISTER_03_BASE)

#define SERIAL_DATA_REGISTER_10_BASE											   														(0xFF48)
#define SDR10										  												   (SDR_Type *)SERIAL_DATA_REGISTER_10_BASE)

#define SERIAL_DATA_REGISTER_11_BASE											   														(0xFF4A)
#define SDR11										  												   (SDR_Type *)SERIAL_DATA_REGISTER_11_BASE)

#define SERIAL_DATA_REGISTER_12_BASE											   														(0xFF14)
#define SDR12										  												   (SDR_Type *)SERIAL_DATA_REGISTER_12_BASE)

#define SERIAL_DATA_REGISTER_13_BASE											   														(0xFF16)
#define SDR13										  												   (SDR_Type *)SERIAL_DATA_REGISTER_13_BASE)



/* Serial Status Register Definition */
typedef struct {
	union {
		volatile uint8_t SSR_L;
		volatile uint8_t SSR_H;
	}ACCESS_8bit;
	volatile uint16_t SSR;
} SSR_Type, *SSR_MemMapPtr;


#define SERIAL_STATUS_REGISTER_00_BASE											   														(0x0100)
#define SSR00																						 (SSR_Type *)SERIAL_STATUS_REGISTER_00_BASE)

#define SERIAL_STATUS_REGISTER_01_BASE											   														(0x0102)
#define SSR01																						 (SSR_Type *)SERIAL_STATUS_REGISTER_01_BASE)

#define SERIAL_STATUS_REGISTER_02_BASE											   														(0x0104)
#define SSR02																						 (SSR_Type *)SERIAL_STATUS_REGISTER_02_BASE)

#define SERIAL_STATUS_REGISTER_03_BASE											   														(0x0106)
#define SSR03																						 (SSR_Type *)SERIAL_STATUS_REGISTER_03_BASE)

