Alark8/RL78_Framework/inc/rl78_g13_head.h
#define SERIAL_STATUS_REGISTER_10_BASE											   														(0x0140)
#define SSR10																						 (SSR_Type *)SERIAL_STATUS_REGISTER_10_BASE)

#define SERIAL_STATUS_REGISTER_11_BASE											  	 													(0x0142)
#define SSR11																						 (SSR_Type *)SERIAL_STATUS_REGISTER_11_BASE)

#define SERIAL_STATUS_REGISTER_12_BASE											  	 													(0x0144)
#define SSR12																						 (SSR_Type *)SERIAL_STATUS_REGISTER_12_BASE)

#define SERIAL_STATUS_REGISTER_13_BASE											   														(0x0146)
#define SSR13																						 (SSR_Type *)SERIAL_STATUS_REGISTER_13_BASE)



/* Serial Flag Clear Trigger Register Definition */
typedef struct {
	union {
		volatile uint8_t SIR_L;
		volatile uint8_t SIR_H;
	}ACCESS_8bit;
	volatile uint16_t SIR;
} SIR_Type, *SIR_MemMapPtr;


#define SERIAL_FLAG_CLEAR_TRIG_REGISTER_00_BASE										   													(0x0108)
#define SIR00								       											(SIR_Type *)SERIAL_FLAG_CLEAR_TRIG_REGISTER_00_BASE)

#define SERIAL_FLAG_CLEAR_TRIG_REGISTER_01_BASE										  	 												(0x010A)
#define SIR01								       											(SIR_Type *)SERIAL_FLAG_CLEAR_TRIG_REGISTER_01_BASE)

#define SERIAL_FLAG_CLEAR_TRIG_REGISTER_02_BASE										   													(0x010C)
#define SIR02								       											(SIR_Type *)SERIAL_FLAG_CLEAR_TRIG_REGISTER_02_BASE)

#define SERIAL_FLAG_CLEAR_TRIG_REGISTER_03_BASE										   													(0x010E)
#define SIR03								       											(SIR_Type *)SERIAL_FLAG_CLEAR_TRIG_REGISTER_03_BASE)

#define SERIAL_FLAG_CLEAR_TRIG_REGISTER_10_BASE										   													(0x0148)
#define SIR10								       											(SIR_Type *)SERIAL_FLAG_CLEAR_TRIG_REGISTER_10_BASE)

#define SERIAL_FLAG_CLEAR_TRIG_REGISTER_11_BASE										   													(0x014A)
#define SIR11								       											(SIR_Type *)SERIAL_FLAG_CLEAR_TRIG_REGISTER_11_BASE)

#define SERIAL_FLAG_CLEAR_TRIG_REGISTER_12_BASE										   													(0x014C)
#define SIR12								       											(SIR_Type *)SERIAL_FLAG_CLEAR_TRIG_REGISTER_12_BASE)

#define SERIAL_FLAG_CLEAR_TRIG_REGISTER_13_BASE										   													(0x014E)
#define SIR13								       											(SIR_Type *)SERIAL_FLAG_CLEAR_TRIG_REGISTER_13_BASE)



/* Serial Mode Register Definition */
typedef struct {
	volatile uint16_t SMR;
} SMR_Type, *SMR_MemMapPtr;


#define SERIAL_MODE_REGISTER_00_BASE											   														(0x0110)
#define SMR00										  												   (SMR_Type *)SERIAL_MODE_REGISTER_00_BASE)

#define SERIAL_MODE_REGISTER_01_BASE											   														(0x0112)
#define SMR01										  												   (SMR_Type *)SERIAL_MODE_REGISTER_01_BASE)

#define SERIAL_MODE_REGISTER_02_BASE											   														(0x0114)
#define SMR02										  												   (SMR_Type *)SERIAL_MODE_REGISTER_02_BASE)

#define SERIAL_MODE_REGISTER_03_BASE											   														(0x0116)
#define SMR03										  												   (SMR_Type *)SERIAL_MODE_REGISTER_03_BASE)

#define SERIAL_MODE_REGISTER_10_BASE											   														(0x0150)
#define SMR10										  												   (SMR_Type *)SERIAL_MODE_REGISTER_10_BASE)

#define SERIAL_MODE_REGISTER_11_BASE											   														(0x0152)
#define SMR11										  												   (SMR_Type *)SERIAL_MODE_REGISTER_11_BASE)

#define SERIAL_MODE_REGISTER_12_BASE											   														(0x0154)
#define SMR12										  												   (SMR_Type *)SERIAL_MODE_REGISTER_12_BASE)

#define SERIAL_MODE_REGISTER_13_BASE											   														(0x0156)
#define SMR13										  												   (SMR_Type *)SERIAL_MODE_REGISTER_13_BASE)



/* Serial Communication Operation Register Definition */
typedef struct {
	volatile uint16_t SCR;
} SCR_Type, *SCR_MemMapPtr;


#define SERIAL_COMM_OPER_REGISTER_00_BASE										   														(0x0118)
#define SCR00									     											  (SCR_Type *)SERIAL_COMM_OPER_REGISTER_00_BASE)

#define SERIAL_COMM_OPER_REGISTER_01_BASE										   														(0x011A)
#define SCR01									     											  (SCR_Type *)SERIAL_COMM_OPER_REGISTER_01_BASE)

#define SERIAL_COMM_OPER_REGISTER_02_BASE										   														(0x011C)
#define SCR02									     											  (SCR_Type *)SERIAL_COMM_OPER_REGISTER_02_BASE)

#define SERIAL_COMM_OPER_REGISTER_03_BASE										   														(0x011E)
#define SCR03									     											  (SCR_Type *)SERIAL_COMM_OPER_REGISTER_03_BASE)

#define SERIAL_COMM_OPER_REGISTER_10_BASE										   														(0x0158)
#define SCR10									     											  (SCR_Type *)SERIAL_COMM_OPER_REGISTER_10_BASE)

#define SERIAL_COMM_OPER_REGISTER_11_BASE										   														(0x015A)
#define SCR11									     											  (SCR_Type *)SERIAL_COMM_OPER_REGISTER_11_BASE)

#define SERIAL_COMM_OPER_REGISTER_12_BASE										   														(0x015C)
#define SCR12									     											  (SCR_Type *)SERIAL_COMM_OPER_REGISTER_12_BASE)

#define SERIAL_COMM_OPER_REGISTER_13_BASE										   														(0x015E)
#define SCR13									     											  (SCR_Type *)SERIAL_COMM_OPER_REGISTER_13_BASE)



/* Serial Information Register Definition */
typedef struct {
	volatile uint16_t SE;
	volatile uint16_t SS;
	volatile uint16_t ST;
	volatile uint16_t SPS;
	volatile uint16_t SO;
	volatile uint16_t SOE;
	volatile uint16_t BL1[4];
	volatile uint16_t SOL;
	volatile uint16_t BL2;
	volatile uint16_t SSC;
} SER_Type, *SER_MemMapPtr;


#define SERIAL_CHANNEL_REGISTER_0_BASE											   														(0x0120)
#define SERIAL0																						 (SER_Type *)SERIAL_CHANNEL_REGISTER_0_BASE)

#define SERIAL_CHANNEL_REGISTER_1_BASE											   														(0x0160)
#define SERIAL1																						 (SER_Type *)SERIAL_CHANNEL_REGISTER_1_BASE)

/* ------------------------------------------------------------- Serial Control Registers --------------------------------------------------------- */










/* ------------------------------------------------------------- LVDS Control Registers ----------------------------------------------------------- */

/* Voltage Functions Register Definition */
typedef struct {
	volatile uint8_t LVIM;
	volatile uint8_t LVIS;
}LVDS_Type, *LVDS_MemMapPtr;


#define VOLTAGE_DETECTION_REGISTER_BASE											   														(0xFFA9)
#define LVDS									      											   (LVDS_Type *)VOLTAGE_DETECTION_REGISTER_BASE)

