Alark8/RL78_Framework/inc/rl78_g13_head.h
/* ------------------------------------------------------------- LVDS Control Registers ----------------------------------------------------------- */











/* ------------------------------------------------------- Priority Specification Registers ------------------------------------------------------ */

/* Priority Specification Flag Register Definition */
typedef struct {
	union {
		volatile uint8_t PR_L;
		volatile uint8_t PR_H;
	}ACCESS_8bit;
	volatile uint16_t PR;
}PRS_Type, *PRS_MemMapPtr;


#define PRIORITY_SPECIFICATION_FLAG_REGISTER_00_BASE									   												(0xFFE8)
#define PR00								 										  ((PRS_Type *)PRIORITY_SPECIFICATION_FLAG_REGISTER_00_BASE)

#define PRIORITY_SPECIFICATION_FLAG_REGISTER_01_BASE									   												(0xFFEA)
#define PR01								 										  ((PRS_Type *)PRIORITY_SPECIFICATION_FLAG_REGISTER_01_BASE)

#define PRIORITY_SPECIFICATION_FLAG_REGISTER_02_BASE									   												(0xFFD8)
#define PR02								 										  ((PRS_Type *)PRIORITY_SPECIFICATION_FLAG_REGISTER_02_BASE)

#define PRIORITY_SPECIFICATION_FLAG_REGISTER_03_BASE									   												(0xFFDA)
#define PR03								 										  ((PRS_Type *)PRIORITY_SPECIFICATION_FLAG_REGISTER_03_BASE)

#define PRIORITY_SPECIFICATION_FLAG_REGISTER_10_BASE									   												(0xFFEC)
#define PR10								 										  ((PRS_Type *)PRIORITY_SPECIFICATION_FLAG_REGISTER_10_BASE)

#define PRIORITY_SPECIFICATION_FLAG_REGISTER_11_BASE									   												(0xFFEE)
#define PR11								 										  ((PRS_Type *)PRIORITY_SPECIFICATION_FLAG_REGISTER_11_BASE)

#define PRIORITY_SPECIFICATION_FLAG_REGISTER_12_BASE									   												(0xFFDC)
#define PR12								 										  ((PRS_Type *)PRIORITY_SPECIFICATION_FLAG_REGISTER_12_BASE)

#define PRIORITY_SPECIFICATION_FLAG_REGISTER_13_BASE									   												(0xFFDE)
#define PR13								 										  ((PRS_Type *)PRIORITY_SPECIFICATION_FLAG_REGISTER_13_BASE)

/* ------------------------------------------------------- Priority Specification Registers ------------------------------------------------------ */















/* Key Mode Register Base Address */
#define KEY_MODE_REGISTER_BASE						 						   															(0xFF37)
#define KEY_MODE_REGISTER							      										   *((volatile uint8_t *)KEY_MODE_REGISTER_BASE)

/* Reset Control Flag Register Base Address */
#define RESET_CONTROL_FLAG_REGISTER_BASE			 							   														(0xFFA8)
#define RESET_CONTROL_FLAG_REGISTER					    								 *((volatile uint8_t *)RESET_CONTROL_FLAG_REGISTER_BASE)

/* Watchdog Timer Enable Register Base Address */
#define WATCHDOG_TIMER_ENABLE_REGISTER_BASE					 					   														(0xFFAB)
#define WATCHDOG_TIMER_ENABLE_REGISTER					 							  *((volatile uint8_t *)WATCHDOG_TIMER_ENABLE_REGISTER_BASE)

/* Data Flash Control Register Address */
#define DATA_FLASH_CTRL_REGISTER_BASE											   														(0x0090)
#define DATA_FLASH_CTRL_REGISTER					       									*((volatile uint8_t *)DATA_FLASH_CTRL_REGISTER_BASE)

/* Peripheral Enable Register Address */
#define PERIPHERAL_ENABLE_REGISTER_BASE											   														(0x00F0)
#define PERIPHERAL_ENABLE_REGISTER					     								  *((volatile uint8_t *)PERIPHERAL_ENABLE_REGISTER_BASE)

/* BCD Adjust Result Register Address */
#define BCD_ADJUST_RESULT_REGISTER_BASE											   														(0x00FE)
#define BCD_ADJUST_RESULT_REGISTER					     								  *((volatile uint8_t *)BCD_ADJUST_RESULT_REGISTER_BASE)


#endif
